import { EmployerDetailViewModel } from "../../../../application/common/models/employer";

export const mockEmployers: EmployerDetailViewModel[] = [
  {
    id: "01960c2a-5ad1-7651-80bf-54760bd9d55a",
    name: "УрФУ",
    avatarUrl:
      "https://img.phb123.com/uploads/allimg/220614/810-220614113K60-L-lp.png",
    description: `Уральский федеральный университет является крупнейшим вузом Урала, ведущим научно-образовательным центром региона и одним из крупнейших вузов Российской Федерации.
В 2023 году университет занял 3 место в Рейтинге крупнейших университетов России и 12 место в России по количеству иностранных студентов, по данным Мониторинга Министерства науки и высшего образования РФ в университете в 2023 году обучались 38 797 и 3 376 чел соответственно.
Учебный процесс обеспечивают 3782 преподавателя, среди них более 560 докторов наук и около 1900 кандидатов наук, более 30 членов государственных академий. Вуз проводит обучение по 102 направлениям бакалавриата, 90 направлениям магистратуры, 126 специальностям аспирантуры и 42 специальностям докторантуры. В университете функционирует более 30 диссертационных советов.`,
  },
  {
    id: "01960c2a-9938-74ff-8fe1-027402ef0b9b",
    name: "ВШЭ СПБ",
    avatarUrl:
      "https://papik.pro/grafic/uploads/posts/2023-04/1681593331_papik-pro-p-niu-vshe-logotip-vektor-6.jpg",
    description: `Национа́льный иссле́довательский университе́т «Вы́сшая шко́ла эконо́мики» (НИУ ВШЭ; разг. «Вы́шка») — автономное учреждение, федеральное государственное высшее учебное заведение. ВШЭ создана в 1992 году, нынешний статус носит с 2009 года. Основной кампус находится в Москве, ещё три — в Санкт-Петербурге, Нижнем Новгороде и Перми. Также имеется онлайн кампус для образовательных программ, проводимых онлайн.`,
  },
];
